In [92]:
import pandas as pd

In [93]:
df = pd.read_csv("jobs.csv")
df

,Company,Title,Location,Type,level,Salary,Requirment,Facilities,Country,cluster,x0,x1,classe
0,SGS,clinical data analyst,"Richardson, TX, United States",Full Time,Junior,48,computer science data quality genetics mathema...,NaN,United States,Machine Learning and Computer Vision,0.093032,0.071434,Machine Learning and Computer Vision
1,Bosch Group,application developer data analyst,"Nonantola, Italy",Full Time,Junior,48,engineering industrial oracle power bi r r,NaN,Italy,Machine Learning and Computer Vision,0.217672,0.116621,Machine Learning and Computer Vision
2,Publicis Groupe,data engineer full time public sector,"Arlington, VA, United States",Full Time,Intermediate,108,aws azure computer science consulting dataflow...,flex hours flex vacation parental leave unlimi...,United States,Data Visualization and Business Analytics,-0.179149,-0.198149,Data Visualization and Business Analytics
3,ServiceNow,data scientist,"Kirkland, Washington, United States",Full Time,Senior,184,computer science deep learning industrial mach...,k matching career development competitive pay ...,United States,Cloud Computing and Data Science,0.405995,-0.211615,Cloud Computing and Data Science
4,Natixis in Portugal,vendor management data quality lead,"Porto, Portugal",Full Time,Junior,39,banking data quality excel security,gear,Portugal,Machine Learning and Computer Vision,0.059897,0.231600,Machine Learning and Computer Vision
...,...,...,...,...,...,...,...,...,...,...,...,...,...
2310,CCRi,application integration engineer computer visi...,"Chantilly, Virginia, United States",Full Time,Intermediate,113,agile angular apis architecture aws azure,k matching career development flex hours flex ...,United States,Data Visualization and Business Analytics,-0.244297,-0.304274,Data Visualization and Business Analytics
2311,Publicis Groupe,associate data science,"New York City, United States",Full Time,Intermediate,106,bayesian classification clustering data analys...,career development health care,United States,Cloud Computing and Data Science,0.243486,0.008272,Cloud Computing and Data Science
2312,DoorDash,software engineer machine learning intelligence,"Sunnyvale, CA; San Francisco, CA; New York",Full Time,Senior,176,computer science data analysis engineering exc...,k matching career development equity insurance...,United States,Machine Learning and Computer Vision,0.134405,0.066488,Machine Learning and Computer Vision
2313,Western Digital,data scientist college graduate,"Biñan, Philippines",Full Time,Junior,39,apis clustering computer science data visualiz...,career development,Philippines,Cloud Computing and Data Science,0.136699,-0.162053,Cloud Computing and Data Science
2314,ATB Financial,data scientist,"Edmonton, Alberta, Canada",Full Time,Junior,39,computer science data analytics data mining ec...,career development startup environment,Canada,Machine Learning and Computer Vision,0.017913,0.110092,Machine Learning and Computer Vision

In [94]:
df.dropna(inplace=True)

In [95]:
df.drop_duplicates(inplace=True, ignore_index=True)

In [96]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1959 entries, 0 to 1958
Data columns (total 13 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Company     1959 non-null   object
 1   Title       1959 non-null   object
 2   Location    1959 non-null   object
 3   Type        1959 non-null   object
 4   level       1959 non-null   object
 5   Salary      1959 non-null   int64
 6   Requirment  1959 non-null   object
 7   Facilities  1959 non-null   object
 8   Country     1959 non-null   object
 9   cluster     1959 non-null   object
 10  x0          1959 non-null   float64
 11  x1          1959 non-null   float64
 12  classe      1959 non-null   object
dtypes: float64(2), int64(1), object(10)
memory usage: 199.1+ KB

In [97]:
len(df['Requirment'].unique())

1741

In [98]:
import pandas as pd
import pyodbc

# Replace the connection string with your actual SQL Server connection string
conn_str = 'DRIVER={SQL Server};SERVER=LAPTOP-REU1GLF5\SQLEXPRESS;DATABASE=Jobs'

# Establish a connection to the database
conn = pyodbc.connect(conn_str)
cursor = conn.cursor()

In [99]:
cursor.execute("IF OBJECT_ID('company_jobs', 'U') IS NOT NULL DROP TABLE company_jobs")
cursor.execute("IF OBJECT_ID('Description', 'U') IS NOT NULL DROP TABLE Description")
cursor.execute("IF OBJECT_ID('Requirement', 'U') IS NOT NULL DROP TABLE Requirement")
cursor.execute("IF OBJECT_ID('Jobs', 'U') IS NOT NULL DROP TABLE Jobs")
cursor.execute("IF OBJECT_ID('company_location', 'U') IS NOT NULL DROP TABLE company_location")
cursor.execute("IF OBJECT_ID('Location', 'U') IS NOT NULL DROP TABLE Location")
cursor.execute("IF OBJECT_ID('Company', 'U') IS NOT NULL DROP TABLE Company")

conn.commit()

In [100]:
# Create the Languages table if it doesn't exist
cursor.execute('''
CREATE TABLE Company (
    company_id INT PRIMARY KEY,
    company_name VARCHAR(100)
)
''')
conn.commit()

In [101]:
unique_company = df['Company'].unique()
for idx, company in enumerate(unique_company):
    cursor.execute("INSERT INTO Company (company_id, company_name) VALUES (?, ?)", idx + 1, company)
    conn.commit()

In [102]:
# Create the Languages table if it doesn't exist
cursor.execute('''
CREATE TABLE Location (
    country_id INT PRIMARY KEY,
    country_name VARCHAR(50)
)
''')
conn.commit()

In [103]:
unique_country = df['Country'].unique()
for idx, country in enumerate(unique_country):
    cursor.execute("INSERT INTO Location (country_id, country_name) VALUES (?, ?)", idx + 1, country)
    conn.commit()

In [104]:
len(unique_country)

78

In [105]:
# Create the Repository_Languages table with foreign keys to Repositories and Languages tables
cursor.execute('''
CREATE TABLE company_location (
    company_id INT,
    country_id INT,
    PRIMARY KEY (company_id, country_id),
    FOREIGN KEY (company_id) REFERENCES Company(company_id),
    FOREIGN KEY (country_id) REFERENCES Location(country_id)
)
''')
conn.commit()

In [106]:
df1 = df[["Company", "Country"]]

In [107]:
unique_country = pd.DataFrame(unique_country)
unique_company = pd.DataFrame(unique_company)

In [108]:
unique_country.reset_index(inplace=True)
unique_company.reset_index(inplace=True)

In [109]:
unique_country.rename(columns={"index":"country_id", 0:"Country"}, inplace=True)
unique_company.rename(columns={"index":"company_id", 0:"Company"}, inplace=True)

In [110]:
unique_country["country_id"] = unique_country["country_id"] + 1
unique_company["company_id"] = unique_company["company_id"] + 1

In [111]:
unique_country

    country_id        Country
0            1  United States
1            2       Portugal
2            3    Switzerland
3            4          India
4            5        Germany
..         ...            ...
73          74         Taiwan
74          75        Albania
75          76     Bangladesh
76          77       Columbia
77          78       Colombia

[78 rows x 2 columns]

In [112]:
unique_company

     company_id              Company
0             1      Publicis Groupe
1             2           ServiceNow
2             3  Natixis in Portugal
3             4   Palo Alto Networks
4             5                 CERN
..          ...                  ...
795         796              23andMe
796         797               WITHIN
797         798             DrDoctor
798         799               Thaloz
799         800            Rackspace

[800 rows x 2 columns]

In [113]:
result_df = pd.merge(df1, unique_country, on='Country', how='left')

In [114]:
result_df = pd.merge(result_df, unique_company, on='Company', how='left')

In [115]:
result_df

                  Company        Country  country_id  company_id
0         Publicis Groupe  United States           1           1
1              ServiceNow  United States           1           2
2     Natixis in Portugal       Portugal           2           3
3      Palo Alto Networks  United States           1           4
4                    CERN    Switzerland           3           5
...                   ...            ...         ...         ...
1954                 CCRi  United States           1         215
1955      Publicis Groupe  United States           1           1
1956             DoorDash  United States           1         433
1957      Western Digital    Philippines          32          15
1958        ATB Financial         Canada          16         498

[1959 rows x 4 columns]

In [116]:
comp_loc_data = []
for row in result_df.itertuples(index=False):
    country_id = row.country_id
    company_id = row.company_id
    comp_loc_data.append((country_id, company_id))

In [117]:
print(comp_loc_data)

[(1, 1), (1, 2), (2, 3), (1, 4), (3, 5), (4, 6), (2, 7), (5, 7), (1, 2), (1, 8), (6, 9), (4, 10), (1, 7), (1, 11), (1, 1), (7, 12), (8, 13), (9, 14), (10, 15), (11, 16), (1, 17), (4, 10), (5, 18), (12, 19), (1, 20), (1, 21), (13, 22), (4, 23), (14, 24), (1, 25), (1, 26), (14, 27), (8, 7), (1, 28), (1, 29), (1, 30), (1, 31), (1, 32), (15, 33), (1, 34), (1, 35), (14, 7), (1, 36), (1, 37), (16, 38), (17, 39), (6, 40), (1, 41), (1, 42), (5, 43), (16, 44), (18, 45), (19, 46), (1, 1), (20, 47), (1, 31), (1, 36), (19, 46), (1, 17), (1, 10), (13, 48), (1, 49), (13, 48), (16, 50), (4, 51), (1, 29), (1, 52), (1, 53), (1, 35), (5, 54), (21, 55), (18, 56), (1, 17), (6, 57), (1, 1), (14, 58), (1, 59), (16, 44), (1, 60), (1, 61), (22, 62), (1, 12), (1, 2), (1, 63), (1, 64), (12, 19), (1, 65), (1, 21), (4, 37), (1, 66), (1, 67), (14, 68), (6, 69), (1, 1), (1, 70), (2, 7), (13, 48), (1, 71), (11, 72), (4, 6), (16, 73), (4, 74), (14, 70), (14, 75), (5, 16), (1, 76), (16, 12), (23, 77), (1, 78), (16, 79), (1, 37), (13, 48), (5, 80), (4, 81), (1, 82), (4, 83), (1, 84), (1, 47), (14, 85), (24, 86), (1, 1), (25, 87), (14, 88), (1, 10), (1, 37), (26, 89), (7, 90), (1, 37), (1, 91), (1, 92), (4, 93), (1, 84), (1, 25), (4, 94), (6, 4), (27, 56), (11, 95), (4, 96), (19, 97), (14, 98), (1, 99), (1, 1), (1, 100), (28, 101), (1, 102), (1, 103), (29, 104), (6, 40), (1, 71), (4, 105), (30, 106), (1, 107), (30, 108), (31, 109), (10, 110), (5, 1), (16, 111), (32, 112), (32, 112), (33, 113), (4, 74), (1, 7), (34, 114), (35, 115), (1, 116), (14, 46), (4, 117), (4, 7), (36, 118), (1, 119), (1, 120), (10, 121), (4, 122), (37, 123), (30, 124), (1, 1), (1, 125), (1, 126), (14, 127), (38, 128), (6, 123), (14, 129), (5, 130), (16, 131), (38, 132), (17, 39), (1, 133), (1, 134), (1, 35), (14, 135), (9, 136), (1, 137), (11, 138), (14, 139), (16, 140), (4, 141), (39, 7), (1, 131), (19, 46), (1, 142), (1, 143), (40, 35), (1, 1), (11, 144), (1, 145), (1, 146), (9, 147), (2, 3), (5, 7), (8, 148), (18, 56), (4, 141), (14, 58), (1, 92), (4, 149), (4, 2), (1, 150), (1, 151), (1, 152), (1, 153), (14, 154), (1, 155), (14, 24), (10, 121), (41, 115), (1, 156), (1, 1), (24, 157), (1, 35), (1, 37), (5, 7), (5, 158), (30, 124), (14, 159), (1, 160), (14, 161), (42, 162), (43, 163), (36, 164), (1, 107), (14, 165), (1, 166), (1, 153), (44, 167), (28, 101), (1, 10), (39, 16), (1, 4), (1, 99), (1, 137), (16, 168), (45, 169), (1, 12), (39, 16), (6, 170), (14, 171), (2, 172), (14, 173), (14, 174), (1, 175), (17, 39), (3, 176), (1, 177), (1, 46), (1, 36), (32, 178), (37, 179), (1, 12), (17, 39), (4, 180), (1, 12), (9, 28), (16, 181), (1, 182), (7, 29), (1, 183), (46, 184), (1, 185), (1, 186), (1, 187), (1, 154), (6, 188), (14, 58), (16, 111), (1, 189), (1, 2), (44, 1), (5, 190), (38, 132), (30, 191), (47, 38), (1, 12), (14, 192), (48, 129), (17, 39), (1, 29), (5, 193), (1, 194), (13, 195), (16, 196), (1, 197), (1, 198), (1, 1), (1, 199), (1, 96), (1, 200), (14, 201), (7, 149), (30, 202), (30, 72), (1, 203), (8, 204), (14, 205), (4, 2), (7, 90), (5, 190), (4, 206), (1, 207), (5, 7), (18, 208), (14, 209), (18, 210), (11, 72), (1, 211), (5, 7), (1, 212), (1, 185), (16, 213), (49, 100), (16, 90), (14, 214), (4, 10), (7, 90), (5, 101), (1, 215), (14, 216), (14, 217), (43, 110), (4, 37), (1, 218), (50, 219), (30, 202), (35, 115), (14, 220), (14, 221), (51, 222), (1, 223), (52, 224), (11, 225), (16, 147), (7, 226), (1, 227), (10, 15), (1, 29), (1, 7), (4, 176), (1, 228), (1, 7), (5, 229), (1, 10), (18, 210), (5, 230), (5, 231), (6, 232), (1, 233), (16, 234), (1, 25), (14, 221), (1, 235), (4, 236), (1, 1), (14, 237), (5, 18), (1, 29), (7, 226), (47, 79), (38, 238), (51, 222), (6, 6), (4, 239), (16, 147), (1, 240), (5, 231), (6, 241), (1, 242), (1, 243), (1, 37), (30, 202), (42, 244), (1, 25), (1, 245), (47, 79), (4, 7), (1, 246), (1, 245), (1, 247), (1, 248), (16, 51), (47, 79), (5, 130), (16, 147), (1, 7), (4, 1), (20, 235), (14, 249), (1, 1), (6, 40), (1, 10), (1, 7), (44, 167), (1, 250), (14, 98), (19, 46), (9, 51), (1, 251), (1, 1), (1, 4), (30, 11), (1, 252), (24, 86), (5, 8), (47, 253), (24, 86), (1, 66), (16, 254), (1, 255), (16, 256), (37, 257), (1, 35), (18, 210), (1, 25), (30, 258), (1, 242), (16, 259), (1, 35), (1, 4), (1, 194), (14, 250), (4, 185), (48, 260), (1, 1), (14, 261), (1, 32), (1, 262), (15, 33), (1, 12), (1, 242), (1, 263), (28, 264), (1, 2), (1, 126), (1, 265), (7, 266), (28, 264), (24, 86), (38, 267), (1, 242), (44, 101), (47, 29), (16, 268), (30, 258), (5, 164), (1, 66), (6, 269), (1, 12), (1, 1), (1, 242), (1, 34), (14, 270), (1, 271), (1, 272), (30, 273), (1, 274), (1, 62), (1, 242), (1, 242), (1, 28), (30, 72), (1, 120), (1, 242), (1, 275), (7, 113), (6, 276), (1, 277), (1, 242), (30, 72), (13, 22), (1, 2), (4, 278), (1, 1), (1, 12), (4, 6), (4, 2), (14, 1), (1, 37), (14, 279), (24, 86), (14, 280), (53, 35), (1, 120), (1, 51), (1, 25), (48, 281), (4, 2), (6, 282), (14, 93), (1, 30), (1, 37), (14, 283), (14, 284), (20, 235), (1, 242), (1, 36), (1, 35), (1, 242), (5, 41), (5, 231), (1, 285), (16, 2), (1, 250), (1, 12), (7, 286), (4, 180), (42, 1), (1, 185), (5, 231), (10, 287), (1, 288), (54, 54), (8, 172), (1, 35), (5, 289), (32, 290), (55, 291), (1, 1), (16, 254), (1, 92), (56, 292), (1, 1), (1, 293), (24, 86), (14, 294), (39, 295), (1, 10), (6, 296), (1, 35), (1, 240), (7, 7), (4, 297), (57, 298), (23, 154), (1, 299), (11, 300), (16, 301), (14, 302), (1, 28), (14, 303), (1, 35), (9, 7), (1, 304), (1, 305), (1, 242), (4, 37), (1, 110), (9, 306), (1, 12), (18, 307), (1, 308), (1, 51), (1, 126), (30, 309), (16, 310), (16, 147), (4, 250), (18, 210), (48, 311), (58, 110), (8, 46), (1, 105), (4, 122), (1, 218), (16, 312), (2, 313), (1, 314), (4, 315), (39, 7), (1, 242), (8, 204), (59, 316), (38, 238), (6, 317), (5, 7), (56, 318), (1, 319), (5, 320), (14, 8), (60, 321), (1, 183), (14, 173), (39, 7), (30, 322), (14, 7), (1, 323), (18, 210), (1, 117), (36, 164), (1, 4), (1, 51), (1, 12), (20, 235), (1, 324), (4, 325), (1, 326), (1, 327), (5, 7), (14, 328), (1, 329), (1, 35), (1, 329), (29, 104), (1, 12), (11, 330), (19, 37), (1, 250), (1, 331), (1, 35), (4, 10), (1, 332), (8, 46), (1, 222), (19, 333), (5, 7), (30, 334), (4, 10), (59, 335), (4, 10), (4, 336), (9, 51), (1, 99), (1, 107), (36, 337), (4, 10), (2, 172), (5, 7), (1, 326), (1, 338), (61, 339), (14, 339), (1, 338), (1, 2), (6, 9), (62, 340), (9, 250), (1, 341), (14, 342), (1, 35), (1, 153), (10, 15), (4, 10), (1, 4), (1, 343), (1, 344), (1, 327), (4, 10), (5, 7), (1, 1), (16, 345), (61, 339), (1, 207), (1, 271), (1, 346), (31, 347), (11, 348), (1, 349), (1, 350), (56, 163), (1, 49), (4, 351), (8, 13), (9, 51), (1, 2), (14, 352), (16, 353), (9, 354), (30, 355), (4, 1), (4, 356), (5, 193), (16, 1), (21, 357), (1, 51), (14, 358), (7, 359), (1, 296), (1, 360), (14, 361), (38, 7), (14, 362), (8, 363), (4, 2), (30, 364), (14, 159), (28, 365), (4, 250), (1, 12), (14, 366), (1, 49), (1, 1), (1, 126), (1, 137), (1, 207), (14, 367), (1, 368), (1, 369), (4, 88), (14, 370), (1, 243), (6, 40), (5, 18), (14, 371), (8, 372), (1, 35), (31, 373), (43, 374), (1, 375), (1, 234), (1, 376), (30, 377), (14, 378), (16, 379), (1, 380), (1, 381), (1, 92), (4, 10), (1, 381), (1, 382), (1, 383), (8, 384), (1, 298), (54, 89), (57, 385), (14, 386), (20, 235), (4, 6), (30, 273), (1, 35), (54, 387), (1, 388), (1, 389), (57, 390), (1, 391), (5, 392), (13, 156), (14, 284), (63, 393), (7, 394), (1, 395), (57, 396), (1, 397), (4, 398), (11, 135), (2, 399), (6, 400), (4, 401), (1, 402), (4, 88), (1, 35), (1, 84), (1, 389), (1, 403), (1, 2), (10, 15), (6, 276), (1, 1), (1, 1), (36, 164), (6, 170), (1, 1), (1, 245), (54, 404), (4, 405), (60, 406), (14, 1), (1, 1), (1, 407), (5, 230), (1, 1), (4, 1), (64, 167), (7, 51), (16, 12), (1, 290), (6, 170), (14, 7), (14, 249), (1, 408), (1, 409), (1, 194), (65, 104), (66, 326), (6, 241), (16, 79), (1, 1), (32, 410), (14, 411), (1, 412), (16, 79), (1, 99), (4, 413), (1, 409), (67, 414), (4, 336), (1, 12), (24, 415), (16, 416), (4, 417), (1, 1), (1, 248), (14, 362), (14, 48), (14, 418), (1, 419), (1, 420), (1, 332), (1, 51), (30, 421), (60, 422), (6, 241), (6, 40), (68, 423), (4, 424), (16, 425), (4, 426), (14, 427), (1, 375), (1, 250), (7, 12), (20, 235), (43, 428), (9, 429), (4, 430), (6, 431), (1, 233), (1, 432), (15, 306), (1, 34), (14, 154), (1, 433), (4, 401), (9, 434), (16, 435), (5, 18), (16, 79), (1, 250), (16, 50), (1, 436), (1, 1), (16, 425), (1, 437), (1, 4), (14, 261), (4, 438), (1, 10), (16, 435), (18, 210), (1, 1), (1, 439), (1, 1), (4, 440), (67, 414), (1, 441), (1, 442), (1, 200), (6, 123), (5, 443), (5, 443), (1, 444), (1, 445), (28, 446), (1, 248), (53, 447), (16, 245), (14, 448), (1, 449), (1, 450), (1, 451), (5, 7), (18, 452), (1, 228), (1, 215), (60, 374), (1, 12), (14, 453), (32, 181), (16, 454), (14, 173), (1, 242), (14, 448), (14, 362), (10, 250), (1, 455), (14, 456), (1, 35), (39, 149), (1, 379), (57, 457), (1, 68), (1, 458), (1, 250), (4, 325), (4, 459), (69, 51), (18, 210), (2, 460), (1, 11), (1, 461), (1, 375), (6, 462), (70, 126), (1, 250), (11, 463), (1, 134), (1, 12), (16, 464), (1, 305), (6, 269), (1, 35), (1, 12), (11, 465), (1, 466), (1, 467), (1, 468), (1, 305), (1, 36), (4, 10), (22, 99), (4, 6), (1, 469), (31, 347), (1, 308), (1, 470), (1, 288), (1, 471), (2, 85), (4, 122), (1, 194), (1, 199), (4, 2), (1, 35), (14, 472), (1, 473), (14, 474), (8, 10), (1, 242), (5, 16), (14, 51), (1, 12), (1, 250), (1, 475), (1, 476), (11, 22), (1, 233), (4, 10), (4, 37), (48, 72), (30, 477), (51, 222), (6, 12), (7, 478), (1, 479), (1, 471), (57, 480), (1, 481), (14, 384), (1, 235), (16, 287), (57, 482), (43, 51), (1, 483), (1, 484), (8, 204), (14, 485), (16, 345), (1, 486), (1, 8), (1, 35), (1, 487), (32, 10), (43, 488), (10, 121), (1, 212), (8, 172), (57, 489), (1, 8), (1, 273), (22, 490), (1, 379), (5, 190), (14, 228), (4, 491), (18, 492), (1, 493), (1, 475), (2, 494), (1, 495), (14, 362), (16, 38), (4, 405), (4, 496), (14, 497), (5, 164), (16, 498), (48, 499), (10, 121), (30, 500), (14, 501), (1, 502), (1, 239), (38, 7), (24, 503), (14, 504), (5, 35), (1, 12), (43, 110), (30, 505), (30, 506), (47, 346), (38, 7), (8, 507), (1, 10), (16, 254), (43, 110), (8, 508), (19, 46), (1, 509), (11, 22), (4, 510), (5, 511), (1, 29), (2, 3), (11, 512), (6, 513), (58, 514), (71, 511), (8, 507), (16, 515), (16, 516), (10, 517), (4, 518), (9, 14), (15, 519), (72, 520), (16, 38), (4, 521), (11, 512), (24, 415), (10, 121), (1, 194), (1, 522), (1, 523), (38, 7), (14, 524), (1, 341), (1, 525), (1, 243), (1, 523), (1, 194), (5, 101), (44, 101), (1, 523), (4, 1), (16, 526), (1, 527), (4, 7), (1, 194), (1, 528), (1, 529), (54, 530), (4, 521), (67, 531), (1, 194), (16, 532), (4, 417), (1, 305), (1, 533), (24, 415), (1, 534), (9, 535), (1, 485), (13, 536), (1, 522), (14, 386), (24, 415), (14, 524), (14, 537), (1, 293), (4, 538), (1, 235), (4, 7), (57, 15), (4, 1), (5, 231), (1, 10), (1, 51), (4, 250), (4, 1), (1, 10), (14, 11), (5, 231), (5, 231), (1, 445), (5, 7), (4, 539), (48, 540), (9, 429), (5, 230), (1, 305), (1, 541), (8, 542), (14, 543), (1, 1), (63, 544), (9, 545), (1, 546), (4, 1), (10, 15), (1, 1), (19, 97), (4, 547), (9, 7), (1, 336), (8, 542), (1, 8), (8, 542), (9, 7), (1, 548), (14, 549), (53, 485), (6, 48), (1, 548), (19, 97), (14, 181), (39, 149), (5, 230), (1, 12), (1, 12), (2, 550), (6, 9), (1, 35), (1, 551), (4, 81), (4, 552), (1, 207), (1, 493), (73, 11), (1, 12), (10, 15), (1, 4), (54, 553), (14, 46), (1, 345), (1, 455), (1, 1), (24, 86), (4, 554), (42, 555), (30, 501), (4, 38), (1, 8), (8, 542), (4, 81), (14, 556), (9, 557), (1, 407), (4, 395), (8, 558), (1, 427), (1, 1), (1, 310), (9, 559), (38, 128), (54, 560), (2, 263), (1, 561), (14, 562), (4, 563), (14, 564), (30, 322), (9, 153), (5, 443), (74, 565), (4, 37), (61, 339), (9, 566), (5, 231), (1, 228), (5, 231), (1, 51), (1, 567), (1, 568), (1, 35), (1, 36), (4, 236), (1, 569), (1, 570), (4, 571), (16, 38), (1, 35), (1, 572), (18, 573), (1, 251), (4, 236), (5, 574), (3, 575), (1, 576), (1, 577), (75, 231), (3, 355), (23, 578), (10, 121), (1, 314), (1, 290), (1, 579), (4, 4), (8, 172), (1, 580), (1, 290), (4, 581), (75, 231), (28, 582), (47, 228), (14, 98), (14, 489), (1, 407), (3, 575), (20, 235), (19, 46), (7, 7), (18, 210), (16, 583), (2, 3), (11, 463), (53, 35), (2, 85), (1, 273), (4, 10), (14, 237), (1, 35), (9, 51), (54, 584), (1, 126), (4, 585), (1, 586), (1, 382), (1, 35), (1, 587), (53, 35), (24, 415), (1, 588), (1, 589), (4, 590), (1, 126), (1, 125), (9, 7), (48, 48), (1, 548), (6, 591), (57, 457), (1, 592), (5, 7), (5, 593), (1, 466), (16, 97), (16, 594), (4, 236), (24, 595), (4, 596), (16, 583), (14, 93), (54, 597), (14, 598), (47, 272), (4, 10), (14, 599), (1, 600), (67, 414), (1, 601), (9, 7), (1, 602), (43, 110), (10, 287), (14, 237), (4, 236), (1, 483), (16, 583), (8, 508), (2, 85), (14, 98), (17, 384), (10, 1), (4, 603), (14, 8), (1, 1), (1, 10), (1, 604), (18, 573), (31, 373), (54, 605), (30, 606), (4, 607), (71, 511), (53, 608), (29, 609), (1, 1), (4, 122), (1, 155), (57, 610), (10, 1), (1, 611), (1, 35), (3, 355), (54, 426), (10, 1), (1, 612), (1, 1), (3, 575), (5, 613), (1, 12), (1, 386), (1, 12), (1, 403), (6, 614), (14, 615), (14, 98), (14, 616), (1, 1), (9, 617), (1, 381), (14, 426), (1, 514), (38, 618), (13, 619), (54, 620), (1, 1), (23, 126), (1, 35), (14, 621), (14, 622), (9, 10), (76, 623), (1, 35), (1, 624), (30, 625), (1, 29), (1, 529), (1, 218), (4, 626), (4, 7), (1, 627), (24, 86), (11, 628), (58, 110), (1, 566), (1, 1), (1, 380), (14, 98), (1, 402), (1, 629), (16, 630), (16, 594), (13, 631), (1, 173), (1, 380), (1, 35), (1, 380), (1, 376), (1, 632), (20, 235), (14, 633), (16, 594), (16, 627), (14, 634), (7, 90), (1, 635), (8, 636), (4, 626), (43, 1), (1, 35), (1, 380), (11, 295), (1, 637), (38, 128), (4, 594), (16, 638), (4, 639), (14, 640), (1, 380), (14, 641), (4, 141), (1, 642), (16, 268), (14, 641), (1, 643), (16, 28), (1, 644), (18, 210), (1, 461), (1, 35), (1, 310), (5, 645), (1, 646), (18, 647), (1, 648), (14, 649), (77, 233), (14, 171), (47, 272), (1, 35), (1, 650), (1, 651), (49, 100), (1, 510), (1, 652), (1, 653), (1, 305), (5, 164), (1, 1), (16, 353), (1, 405), (14, 1), (14, 249), (1, 104), (14, 654), (1, 12), (6, 1), (30, 202), (1, 29), (42, 655), (1, 409), (11, 656), (1, 657), (5, 658), (1, 659), (1, 657), (6, 10), (23, 660), (1, 12), (65, 295), (24, 661), (1, 662), (1, 461), (1, 12), (1, 29), (38, 128), (42, 655), (2, 7), (5, 658), (20, 35), (5, 663), (1, 118), (4, 250), (1, 251), (1, 664), (42, 655), (6, 276), (5, 231), (1, 662), (16, 665), (14, 666), (14, 362), (1, 667), (1, 339), (1, 668), (18, 210), (1, 657), (3, 575), (6, 296), (5, 658), (1, 46), (1, 463), (13, 441), (1, 2), (4, 172), (4, 250), (1, 496), (14, 250), (42, 655), (1, 662), (42, 655), (3, 575), (1, 8), (5, 669), (1, 601), (11, 663), (42, 655), (42, 655), (6, 241), (42, 655), (1, 35), (54, 670), (1, 248), (11, 656), (5, 658), (1, 671), (11, 656), (1, 375), (14, 672), (14, 673), (5, 663), (1, 35), (1, 674), (31, 11), (1, 1), (1, 12), (16, 675), (1, 525), (4, 2), (14, 676), (30, 72), (8, 677), (1, 678), (1, 248), (1, 47), (43, 679), (1, 100), (1, 680), (15, 33), (14, 681), (4, 10), (30, 72), (7, 212), (1, 682), (9, 683), (13, 684), (48, 300), (8, 124), (12, 514), (28, 365), (1, 685), (1, 77), (1, 686), (14, 687), (5, 72), (1, 47), (1, 688), (1, 346), (30, 689), (2, 7), (6, 9), (1, 690), (1, 403), (14, 691), (1, 310), (53, 10), (2, 3), (29, 609), (4, 126), (28, 692), (14, 1), (38, 128), (4, 88), (16, 111), (16, 310), (10, 121), (4, 693), (4, 571), (38, 7), (1, 51), (1, 35), (1, 694), (16, 695), (1, 688), (30, 501), (30, 696), (4, 405), (30, 697), (1, 1), (19, 46), (1, 698), (1, 29), (14, 699), (24, 415), (66, 700), (47, 701), (2, 3), (1, 346), (1, 702), (20, 235), (16, 703), (1, 46), (5, 231), (1, 704), (24, 415), (16, 35), (4, 93), (1, 705), (14, 287), (14, 706), (1, 11), (1, 542), (1, 228), (1, 336), (24, 415), (1, 338), (24, 415), (1, 2), (1, 310), (4, 172), (1, 380), (14, 707), (1, 708), (1, 338), (5, 164), (14, 46), (6, 591), (1, 183), (57, 306), (4, 491), (4, 122), (1, 496), (48, 441), (48, 48), (16, 310), (1, 709), (38, 132), (5, 231), (14, 497), (1, 710), (1, 502), (48, 505), (16, 38), (57, 41), (1, 12), (4, 711), (24, 415), (4, 590), (8, 250), (1, 433), (3, 712), (1, 576), (14, 46), (14, 283), (1, 344), (1, 678), (48, 48), (28, 713), (14, 537), (1, 194), (1, 250), (2, 172), (1, 250), (5, 289), (9, 213), (48, 300), (54, 714), (1, 35), (14, 24), (4, 122), (1, 715), (24, 415), (54, 716), (24, 415), (1, 717), (1, 12), (1, 433), (54, 716), (1, 718), (1, 678), (1, 1), (1, 91), (1, 567), (1, 719), (1, 720), (1, 35), (14, 721), (5, 463), (1, 483), (16, 722), (16, 723), (24, 415), (24, 415), (1, 724), (1, 35), (14, 46), (4, 185), (1, 187), (1, 501), (1, 250), (1, 725), (5, 289), (1, 726), (1, 11), (48, 48), (1, 709), (24, 415), (5, 727), (1, 29), (1, 12), (6, 132), (48, 48), (4, 2), (1, 728), (1, 65), (21, 729), (1, 730), (16, 731), (1, 732), (1, 702), (30, 733), (1, 734), (14, 1), (1, 735), (14, 622), (4, 736), (1, 12), (14, 453), (14, 622), (1, 228), (1, 737), (1, 738), (28, 593), (1, 739), (4, 93), (41, 46), (9, 740), (6, 513), (1, 741), (20, 660), (1, 737), (5, 742), (1, 1), (30, 500), (1, 739), (4, 438), (1, 561), (5, 230), (1, 126), (14, 27), (14, 743), (14, 744), (1, 745), (1, 719), (1, 4), (57, 610), (1, 739), (1, 12), (5, 7), (1, 37), (30, 746), (1, 1), (57, 747), (47, 98), (14, 748), (1, 403), (1, 380), (1, 749), (16, 51), (1, 4), (4, 10), (1, 647), (1, 750), (5, 231), (1, 10), (1, 737), (1, 4), (14, 751), (14, 85), (1, 739), (1, 310), (4, 438), (1, 47), (59, 752), (1, 561), (7, 90), (1, 47), (30, 85), (1, 753), (1, 25), (14, 754), (1, 755), (5, 756), (4, 603), (1, 757), (30, 85), (14, 743), (1, 758), (14, 1), (1, 759), (14, 641), (41, 46), (1, 642), (43, 760), (41, 46), (14, 129), (43, 761), (1, 762), (20, 235), (4, 426), (14, 763), (7, 90), (4, 764), (24, 86), (4, 7), (4, 765), (32, 766), (54, 605), (8, 358), (1, 749), (1, 767), (5, 164), (54, 768), (29, 769), (14, 279), (5, 770), (48, 771), (14, 772), (1, 243), (16, 583), (1, 223), (1, 773), (4, 395), (1, 20), (54, 768), (1, 35), (29, 769), (1, 380), (1, 774), (14, 775), (69, 113), (23, 77), (1, 776), (1, 777), (9, 649), (11, 463), (1, 762), (1, 778), (1, 380), (1, 103), (1, 380), (4, 405), (1, 215), (1, 779), (1, 774), (1, 380), (1, 776), (5, 780), (1, 781), (1, 1), (4, 7), (1, 758), (1, 758), (48, 72), (14, 754), (4, 330), (14, 556), (18, 210), (1, 51), (11, 16), (1, 1), (1, 29), (1, 12), (1, 66), (1, 250), (1, 51), (1, 66), (1, 782), (1, 10), (1, 783), (9, 136), (19, 97), (16, 784), (19, 97), (78, 1), (41, 46), (14, 51), (16, 245), (1, 785), (2, 7), (4, 6), (4, 440), (47, 141), (1, 786), (5, 645), (1, 787), (11, 184), (14, 788), (14, 10), (14, 641), (3, 338), (14, 789), (38, 128), (1, 786), (1, 1), (16, 353), (3, 575), (39, 790), (2, 7), (48, 791), (53, 35), (61, 787), (7, 792), (14, 173), (18, 210), (47, 663), (61, 787), (63, 793), (1, 91), (2, 399), (14, 412), (28, 10), (18, 210), (1, 794), (1, 12), (4, 10), (4, 7), (57, 795), (14, 64), (67, 531), (1, 796), (16, 10), (1, 35), (7, 797), (14, 798), (1, 37), (1, 379), (1, 375), (14, 489), (1, 245), (1, 382), (1, 667), (30, 355), (18, 210), (43, 1), (78, 799), (14, 598), (14, 663), (1, 305), (60, 7), (29, 609), (77, 233), (5, 663), (4, 800), (20, 272), (42, 1), (2, 70), (1, 314), (1, 287), (14, 427), (1, 427), (14, 85), (1, 427), (1, 2), (2, 460), (1, 85), (1, 215), (1, 1), (1, 433), (32, 15), (16, 498)]

In [118]:
print(len(comp_loc_data))

1959

In [119]:
comp_loc = list(set(comp_loc_data))

In [120]:
print(len(comp_loc))

1023

In [121]:
  for data in comp_loc:
    cursor.execute("INSERT INTO company_location (country_id, company_id) VALUES (?, ?)", data[0], data[1])
    conn.commit()

In [122]:
df.columns

Index(['Company', 'Title', 'Location', 'Type', 'level', 'Salary', 'Requirment',
       'Facilities', 'Country', 'cluster', 'x0', 'x1', 'classe'],
      dtype='object')

In [123]:
df2 = df[['Title', 'Type', 'Salary']]

In [124]:
df2

                                                  Title       Type  Salary
0                 data engineer full time public sector  Full Time     108
1                                        data scientist  Full Time     184
2                   vendor management data quality lead  Full Time      39
3           principal cloud data engineer prisma access  Full Time     140
4                                   data scientist grap  Full Time      40
...                                                 ...        ...     ...
1954  application integration engineer computer visi...  Full Time     113
1955                             associate data science  Full Time     106
1956    software engineer machine learning intelligence  Full Time     176
1957                    data scientist college graduate  Full Time      39
1958                                     data scientist  Full Time      39

[1959 rows x 3 columns]

In [125]:
unique_jobs = df2['Title'].unique()

In [126]:
len(unique_jobs)

1145

In [127]:
unique_jobs = pd.DataFrame(unique_jobs)
unique_jobs.reset_index(inplace=True)
unique_jobs.rename(columns={"index":"jobs_id", 0:"Title"}, inplace=True)
unique_jobs["jobs_id"] = unique_jobs["jobs_id"] + 1
unique_jobs

      jobs_id                                              Title
0           1              data engineer full time public sector
1           2                                     data scientist
2           3                vendor management data quality lead
3           4        principal cloud data engineer prisma access
4           5                                data scientist grap
...       ...                                                ...
1140     1141                             people data specialist
1141     1142            machine learning engineer trip planning
1142     1143  application integration engineer computer visi...
1143     1144    software engineer machine learning intelligence
1144     1145                    data scientist college graduate

[1145 rows x 2 columns]

In [128]:
# Create the table if it doesn't exist
cursor.execute('''
CREATE TABLE Jobs (
    job_id INT PRIMARY KEY,
    Title VARCHAR(100)
)
''')
conn.commit()

In [129]:
# Insert data into the table
for row in unique_jobs.itertuples(index=False):
    cursor.execute("INSERT INTO Jobs (job_id, Title) VALUES (?, ?)", 
                   row.jobs_id, row.Title)
    conn.commit()

In [130]:
jobs_company = pd.merge(unique_jobs, df, on='Title', how='left')

In [131]:
jobs_company

,jobs_id,Title,Company,Location,Type,level,Salary,Requirment,Facilities,Country,cluster,x0,x1,classe
0,1,data engineer full time public sector,Publicis Groupe,"Arlington, VA, United States",Full Time,Intermediate,108,aws azure computer science consulting dataflow...,flex hours flex vacation parental leave unlimi...,United States,Data Visualization and Business Analytics,-0.179149,-0.198149,Data Visualization and Business Analytics
1,2,data scientist,ServiceNow,"Kirkland, Washington, United States",Full Time,Senior,184,computer science deep learning industrial mach...,k matching career development competitive pay ...,United States,Cloud Computing and Data Science,0.405995,-0.211615,Cloud Computing and Data Science
2,2,data scientist,ServiceNow,"Kirkland, Washington, United States",Full Time,Senior,159,computer science deep learning industrial mach...,k matching career development competitive pay ...,United States,Cloud Computing and Data Science,0.405995,-0.211615,Cloud Computing and Data Science
3,2,data scientist,Sunnova Energy International,United States,Full Time,Senior,129,agile apis architecture aws big data classific...,career development,United States,Data Visualization and Business Analytics,-0.325900,-0.263721,Data Visualization and Business Analytics
4,2,data scientist,Monzo,"Cardiff, London or Remote (UK)",Full Time,Senior,129,b testing banking data mining finance looker p...,career development conferences flex hours,United Kingdom,Machine Learning and Computer Vision,0.150298,0.202743,Machine Learning and Computer Vision
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1954,1141,people data specialist,Marley Spoon,"Lisbon, Lisbon, Portugal",Full Time,Intermediate,70,data analysis excel finance,career development equity flex hours flex vaca...,Portugal,Machine Learning and Computer Vision,0.065655,0.374789,Machine Learning and Computer Vision
1955,1142,machine learning engineer trip planning,TripAdvisor,"Needham, Massachusetts, MA",Full Time,Senior,170,big data computer science computer vision engi...,career development conferences flex hours flex...,United States,Machine Learning and Computer Vision,0.062663,-0.138996,Machine Learning and Computer Vision
1956,1143,application integration engineer computer visi...,CCRi,"Chantilly, Virginia, United States",Full Time,Intermediate,113,agile angular apis architecture aws azure,k matching career development flex hours flex ...,United States,Data Visualization and Business Analytics,-0.244297,-0.304274,Data Visualization and Business Analytics
1957,1144,software engineer machine learning intelligence,DoorDash,"Sunnyvale, CA; San Francisco, CA; New York",Full Time,Senior,176,computer science data analysis engineering exc...,k matching career development equity insurance...,United States,Machine Learning and Computer Vision,0.134405,0.066488,Machine Learning and Computer Vision
1958,1145,data scientist college graduate,Western Digital,"Biñan, Philippines",Full Time,Junior,39,apis clustering computer science data visualiz...,career development,Philippines,Cloud Computing and Data Science,0.136699,-0.162053,Cloud Computing and Data Science

In [132]:
jobs_company = pd.merge(jobs_company, unique_company, on='Company', how='left')

In [133]:
jobs_company.columns

Index(['jobs_id', 'Title', 'Company', 'Location', 'Type', 'level', 'Salary',
       'Requirment', 'Facilities', 'Country', 'cluster', 'x0', 'x1', 'classe',
       'company_id'],
      dtype='object')

In [134]:
jobs_company = jobs_company[["Title", "jobs_id", "Company", "company_id"]]

In [135]:
jobs_company

,Title,jobs_id,Company,company_id
0,data engineer full time public sector,1,Publicis Groupe,1
1,data scientist,2,ServiceNow,2
2,data scientist,2,ServiceNow,2
3,data scientist,2,Sunnova Energy International,21
4,data scientist,2,Monzo,24
...,...,...,...,...
1954,people data specialist,1141,Marley Spoon,460
1955,machine learning engineer trip planning,1142,TripAdvisor,85
1956,application integration engineer computer visi...,1143,CCRi,215
1957,software engineer machine learning intelligence,1144,DoorDash,433
1958,data scientist college graduate,1145,Western Digital,15

In [136]:
# Create the Repository_Languages table with foreign keys to Repositories and Languages tables
cursor.execute('''
CREATE TABLE company_jobs (
    company_id INT,
    job_id INT,
    PRIMARY KEY (company_id, job_id),
    FOREIGN KEY (company_id) REFERENCES Company(company_id),
    FOREIGN KEY (job_id) REFERENCES Jobs(job_id)
)
''')
conn.commit()

In [137]:
comp_loc_data = []
for row in jobs_company.itertuples(index=False):
    job_id = row.jobs_id
    company_id = row.company_id
    comp_loc_data.append((job_id, company_id))

In [138]:
comp_loc = list(set(comp_loc_data))

In [139]:
len(comp_loc)

1742

In [140]:
for data in comp_loc:
    cursor.execute("INSERT INTO company_jobs (job_id, company_id) VALUES (?, ?)", data[0], data[1])
    conn.commit()

In [141]:
len(unique_req)

1741

In [142]:
unique_req = df['Requirment'].unique()
unique_req = pd.DataFrame(unique_req)
unique_req.reset_index(inplace=True)
unique_req.rename(columns={"index":"req_id", 0:"Requirment"}, inplace=True)
unique_req["req_id"] = unique_req["req_id"] + 1
unique_req

# Create the table if it doesn't exist
cursor.execute('''
CREATE TABLE Requirement (
    req_id INT PRIMARY KEY,
    requirement VARCHAR(500)
)
''')
conn.commit()

# Insert data into the table
for row in unique_req.itertuples(index=False):
    cursor.execute("INSERT INTO Requirement (req_id, requirement) VALUES (?, ?)", 
                   row.req_id, row.Requirment)
    conn.commit()

In [143]:
df.columns

Index(['Company', 'Title', 'Location', 'Type', 'level', 'Salary', 'Requirment',
       'Facilities', 'Country', 'cluster', 'x0', 'x1', 'classe'],
      dtype='object')

In [144]:
df2 = df[['Title', 'Type', 'level', 'Salary', 'classe', 'Requirment']]

In [145]:
result_df2 = pd.merge(df2, unique_jobs, on='Title', how='left')

In [146]:
result_df2 = pd.merge(result_df2, unique_req, on='Requirment', how='left')

In [147]:
result_df2

,Title,Type,level,Salary,classe,Requirment,jobs_id,req_id
0,data engineer full time public sector,Full Time,Intermediate,108,Data Visualization and Business Analytics,aws azure computer science consulting dataflow...,1,1
1,data scientist,Full Time,Senior,184,Cloud Computing and Data Science,computer science deep learning industrial mach...,2,2
2,vendor management data quality lead,Full Time,Junior,39,Machine Learning and Computer Vision,banking data quality excel security,3,3
3,principal cloud data engineer prisma access,Full Time,Senior,140,Data Visualization and Business Analytics,agile apis aws azure big data computer science,4,4
4,data scientist grap,Full Time,Junior,40,Cloud Computing and Data Science,computer science data analysis deep learning k...,5,5
...,...,...,...,...,...,...,...,...
1954,application integration engineer computer visi...,Full Time,Intermediate,113,Data Visualization and Business Analytics,agile angular apis architecture aws azure,1143,323
1955,associate data science,Full Time,Intermediate,106,Cloud Computing and Data Science,bayesian classification clustering data analys...,501,1738
1956,software engineer machine learning intelligence,Full Time,Senior,176,Machine Learning and Computer Vision,computer science data analysis engineering exc...,1144,1739
1957,data scientist college graduate,Full Time,Junior,39,Cloud Computing and Data Science,apis clustering computer science data visualiz...,1145,1740
1958,data scientist,Full Time,Junior,39,Machine Learning and Computer Vision,computer science data analytics data mining ec...,2,1741

In [148]:
result_df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1959 entries, 0 to 1958
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Title       1959 non-null   object
 1   Type        1959 non-null   object
 2   level       1959 non-null   object
 3   Salary      1959 non-null   int64
 4   classe      1959 non-null   object
 5   Requirment  1959 non-null   object
 6   jobs_id     1959 non-null   int64
 7   req_id      1959 non-null   int64
dtypes: int64(3), object(5)
memory usage: 122.6+ KB

In [149]:
# Create the table if it doesn't exist
cursor.execute('''
CREATE TABLE Description (
    Type VARCHAR(50),
    Salary INT,
    job_id INT,
    classe VARCHAR(100),
    level VARCHAR(50),
    req_id INT,
    FOREIGN KEY (job_id) REFERENCES Jobs(job_id),
    FOREIGN KEY (req_id) REFERENCES Requirement(req_id)
)
''')
conn.commit()

# Insert data into the table
for row in result_df2.itertuples(index=False):
    cursor.execute("INSERT INTO Description (Type, Salary, job_id, classe, level, req_id ) VALUES (?, ?, ?, ?, ?, ?)",
                   row.Type, row.Salary, row.jobs_id, row.classe, row.level, row.req_id )
    conn.commit()